MemMaoxin/Acupoint/ADG725_master_2021_2_26/EEG/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_blinky/main.c
BLE_LBS_DEF(m_lbs);                                                             /**< LED Button Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr); 

/**< Context for the Queued Write module.*/
//static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(2);

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};

static void EEG_meas_timeout_handler(nrf_timer_event_t event_type, void* p_context)
{
	    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
						uint16_t  length= EEG_Data_length;
						ret_code_t  err_code;
						static uint16_t cnt = 0;
						uint8_t Data[6];

						ADC32_PulseConversion(Data);
					 
						transmitted_data[0+cnt*5]=Data[1];
						transmitted_data[1+cnt*5]=Data[2];
						transmitted_data[2+cnt*5]=Data[3];
						transmitted_data[3+cnt*5]=Data[4];
						transmitted_data[4+cnt*5]=0xaa;
						
						cnt++;
		//				value|=Data[0]<<24;
		//				value|=Data[1]<<16;
		//				value|=Data[2]<<8;
		//				value|=Data[3];
		//				printf("%d\r\n",cnt);
					if(cnt>=40) 
					{
						cnt=0;
//					do
//						{
								err_code=ble_lbs_on_button_change1(m_conn_handle, &m_lbs, transmitted_data);//数据长度len在函数里
//								
//								if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) &&
//												 (err_code != NRF_ERROR_NOT_FOUND) && err_code != NRF_ERROR_RESOURCES)
//								{
//										 APP_ERROR_CHECK(err_code);
//								}
//						} while (err_code == NRF_ERROR_BUSY ||err_code== NRF_ERROR_RESOURCES);	
					}	
					break;

        default:
            //Do nothing.
            break;
    }
}



void ADC32_PulseMode_Init(void)
{
    uint32_t time_ticks;
    uint32_t err_code;
	
		//初始化spi函数 
		hal_spi_init();//初始化SPI
		//定时器初始化，采用参数:400kHz
	  nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
		//初始化定时器，注册中断函数
    err_code = nrf_drv_timer_init(&TIMER_EEG, &timer_cfg, EEG_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
		//将定时时间转化为定时器的滴答时间，即CC[n]比较器的值
   // time_ticks =nrf_drv_timer_ms_to_ticks(&TIMER_EEG,200);
		time_ticks =1250;     //1250
    //设置定时器为比较模式，触发定时器比较，到达时间后清除计数器，设置通道和滴答数
    nrf_drv_timer_extended_compare(
         &TIMER_EEG, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
	
	//初始化DRDY引脚
		nrf_gpio_cfg_input(DRDY,NRF_GPIO_PIN_NOPULL);//设置DRDY引脚为上拉输入，当转换完成时，该脚拉低
}

void ADC32_PulseMode_Uninit(void)
{
    uint32_t time_ticks;
    uint32_t err_code;
	
		//去初始化spi函数 
		hal_spi_uninit();
	
		nrf_gpio_pin_clear(SPI_MOSI_PIN);
		nrf_gpio_pin_clear(SPI_MISO_PIN);
		nrf_gpio_pin_clear(SPI_SS_PIN);
		nrf_gpio_pin_clear(SPI_SCK_PIN);
		//去定时器初始化
		nrf_drv_timer_disable(&TIMER_EEG);
		nrf_drv_timer_clear(&TIMER_EEG);
//		nrf_drv_timer_uninit(&TIMER_EEG);
	
	//去初始化DRDY引脚
	//	nrf_gpio_pin_clear(DRDY);

}
/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    ret_code_t    err_code;
    ble_advdata_t advdata;
    ble_advdata_t srdata;

    ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, m_lbs.uuid_type}};

